redis-cluster/redis-benchmark-results.txt
[min@t410 src]$ ./redis-benchmark -h 172.19.0.2
====== PING_INLINE ======
  100000 requests completed in 1.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.94% <= 1 milliseconds
100.00% <= 1 milliseconds
88967.98 requests per second

====== PING_BULK ======
  100000 requests completed in 1.22 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
100.00% <= 1 milliseconds
81766.15 requests per second

====== SET ======
  100000 requests completed in 1.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.16% <= 1 milliseconds
99.82% <= 2 milliseconds
99.92% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 4 milliseconds
67842.61 requests per second

====== GET ======
  100000 requests completed in 1.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.98% <= 1 milliseconds
100.00% <= 1 milliseconds
85984.52 requests per second

====== INCR ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.51% <= 1 milliseconds
100.00% <= 1 milliseconds
77279.75 requests per second

====== LPUSH ======
  100000 requests completed in 1.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.11% <= 1 milliseconds
100.00% <= 1 milliseconds
70972.32 requests per second

====== RPUSH ======
  100000 requests completed in 1.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.01% <= 1 milliseconds
100.00% <= 2 milliseconds
71942.45 requests per second

====== LPOP ======
  100000 requests completed in 1.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.90% <= 1 milliseconds
100.00% <= 1 milliseconds
78678.20 requests per second

====== RPOP ======
  100000 requests completed in 1.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.95% <= 1 milliseconds
100.00% <= 1 milliseconds
81103.00 requests per second

====== SADD ======
  100000 requests completed in 1.15 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.97% <= 1 milliseconds
100.00% <= 1 milliseconds
86880.97 requests per second

====== SPOP ======
  100000 requests completed in 1.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.99% <= 1 milliseconds
100.00% <= 1 milliseconds
88652.48 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.40 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.57% <= 1 milliseconds
100.00% <= 1 milliseconds
71275.84 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.30% <= 1 milliseconds
99.90% <= 2 milliseconds
99.95% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 5 milliseconds
40032.03 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 6.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
81.54% <= 2 milliseconds
98.98% <= 3 milliseconds
99.89% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
14304.10 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 10.86 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
4.70% <= 2 milliseconds
78.74% <= 3 milliseconds
85.69% <= 4 milliseconds
93.20% <= 5 milliseconds
97.76% <= 6 milliseconds
98.01% <= 7 milliseconds
99.75% <= 8 milliseconds
99.95% <= 9 milliseconds
99.97% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
9204.71 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 13.48 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.07% <= 2 milliseconds
78.28% <= 3 milliseconds
81.24% <= 4 milliseconds
81.65% <= 5 milliseconds
89.05% <= 6 milliseconds
99.25% <= 7 milliseconds
99.94% <= 8 milliseconds
99.96% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 14 milliseconds
7416.20 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

46.12% <= 1 milliseconds
99.75% <= 2 milliseconds
100.00% <= 3 milliseconds
42553.19 requests per second